Classes/Junior Year/January 2019/Assignment 3/Tutorial Files/TUT1/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
/*   Windows 32 and 64 bit porting by blueCAPE: http://www.bluecape.com.pt   *\
|  Based on Windows porting (2.0.x v4) by Symscape: http://www.symscape.com   |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
1000
(
(1.09545 0.00037596 0)
(1.09494 0.000126586 3.20402e-027)
(1.09461 0.000204229 0)
(1.09414 0.000273081 0)
(1.09353 0.000331757 0)
(1.09283 0.00038012 0)
(1.09203 0.000418904 0)
(1.09117 0.000449324 2.12369e-027)
...
)
;

boundaryField
{
    walls
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    inlet
    {
        type            fixedValue;
        value           uniform (1 0 0);
    }
    outlet
    {
        type            outletInlet;
        outletValue     uniform (1 0 0);
        value           uniform (1 0 0);
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
